Revit 2026 API

# LogicalAndFilter(IListElementFilter) Constructor

---

Initializes a new instance of the LogicalAndFilter class

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public LogicalAndFilter(
	IList<ElementFilter> filters
)
```
```vb
Public Sub New (
	filters As IList(Of ElementFilter)
)
```
```cpp
public:
LogicalAndFilter(
	IList<ElementFilter^>^ filters
)
```
```fsharp
new :
        filters : IList<ElementFilter> -> LogicalAndFilter
```

#### Parameters

filters IListElementFilter

#### Reference

LogicalAndFilter Class

LogicalAndFilter Overload

Autodesk.Revit.DB Namespace